; domain
(define (domain blocksworld)
    (:requirements :typing)
    (:types block robot)
    (:predicates 
        (on ?x - block ?y - block) ; observed predicate
        (ontable ?x - block)  ; derived predicate
        (clear ?x - block)  ; derived predicate
        (handempty ?x - robot)  ; derived predicate
        (handfull ?x - robot)  ; derived predicate
        (holding ?x - block) ; derived predicate
    )
    (:action pick_up
        :parameters (?x - block ?robot - robot)
        :precondition (and
            (clear ?x) 
            (ontable ?x) 
            (handempty ?robot)
        )
        :effect (and
            (not (ontable ?x))
            (not (clear ?x))
            (not (handempty ?robot))
            (handfull ?robot)
            (holding ?x)
        )
    )
    (:action put_down
        :parameters (?x - block ?robot - robot)
        :precondition (and 
            (holding ?x)
            (handfull ?robot)
        )
        :effect (and 
            (not (holding ?x))
            (clear ?x)
            (handempty ?robot)
            (not (handfull ?robot))
            (ontable ?x))
        )
    (:action stack
        :parameters (?x - block ?y - block ?robot - robot)
        :precondition (and
            (holding ?x) 
            (clear ?y)
            (handfull ?robot)
        )
        :effect (and 
            (not (holding ?x))
            (not (clear ?y))
            (clear ?x)
            (handempty ?robot)
            (not (handfull ?robot))
            (on ?x ?y)
        )
    )
    (:action unstack
        :parameters (?x - block ?y - block ?robot - robot)
        :precondition (and
            (on ?x ?y)
            (clear ?x)
            (handempty ?robot)
        )
        :effect (and 
            (holding ?x)
            (clear ?y)
            (not (clear ?x))
            (not (handempty ?robot))
            (handfull ?robot)
            (not (on ?x ?y))
        )
    )
)

; problem
(define (problem blocksworld4)
(:domain blocksworld)
(:objects
    colored_block3 - block 
    arm - robot 
    yellow_block - block 
    orange_block - block 
    blue_purple_block - block 
    red_block - block 
)

(:init
    ( clear blue_purple_block )
    ( clear colored_block3 )
    ( clear orange_block )
    ( clear yellow_block )
    ( handempty arm )
    ( on colored_block3 red_block )
    ( on yellow_block red_block )
    ( ontable blue_purple_block )
    ( ontable orange_block )
    ( ontable red_block )
)

    (:goal (and (on orange_block yellow_block) (on yellow_block blue_purple_block) (on blue_purple_block red_block)))
)

; plan
1. (unstack colored_block3 red_block arm)
   deleted: (clear colored_block3) (handempty arm) (on colored_block3 red_block)
   added: (holding colored_block3) (clear red_block) (handfull arm)
   goals met: 0 of 3
2. (put_down colored_block3 arm)
   deleted: (holding colored_block3) (handfull arm)
   added: (clear colored_block3) (handempty arm) (ontable colored_block3)
   goals met: 0 of 3
3. (pick_up orange_block arm)
   deleted: (ontable orange_block) (clear orange_block) (handempty arm)
   added: (handfull arm) (holding orange_block)
   goals met: 0 of 3
4. (stack orange_block yellow_block arm)
   deleted: (holding orange_block) (clear yellow_block) (handfull arm)
   added: (clear orange_block) (handempty arm) (on orange_block yellow_block)
   goals met: 1 of 3
5. (pick_up blue_purple_block arm)
   deleted: (ontable blue_purple_block) (clear blue_purple_block) (handempty arm)
   added: (handfull arm) (holding blue_purple_block)
   goals met: 1 of 3
6. (stack blue_purple_block red_block arm)
   deleted: (holding blue_purple_block) (clear red_block) (handfull arm)
   added: (clear blue_purple_block) (handempty arm) (on blue_purple_block red_block)
   goals met: 2 of 3
7. (unstack orange_block yellow_block arm)
   deleted: (clear orange_block) (handempty arm) (on orange_block yellow_block)
   added: (holding orange_block) (clear yellow_block) (handfull arm)
   goals met: 1 of 3
8. (put_down orange_block arm)
   deleted: (holding orange_block) (handfull arm)
   added: (clear orange_block) (handempty arm) (ontable orange_block)
   goals met: 1 of 3
9. (unstack yellow_block red_block arm)
   deleted: (clear yellow_block) (handempty arm) (on yellow_block red_block)
   added: (holding yellow_block) (clear red_block) (handfull arm)
   goals met: 1 of 3
10. (stack yellow_block blue_purple_block arm)
   deleted: (holding yellow_block) (clear blue_purple_block) (handfull arm)
   added: (clear yellow_block) (handempty arm) (on yellow_block blue_purple_block)
   goals met: 2 of 3
11. (pick_up orange_block arm)
   deleted: (ontable orange_block) (clear orange_block) (handempty arm)
   added: (handfull arm) (holding orange_block)
   goals met: 2 of 3
12. (stack orange_block yellow_block arm)
   deleted: (holding orange_block) (clear yellow_block) (handfull arm)
   added: (clear orange_block) (handempty arm) (on orange_block yellow_block)
   goals met: 3 of 3
